
## Plan Result (terraform/aws/palserver)

[CI link](https://github.com/boxp/arch/actions/runs/8270292676)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ecr_repository.palserver


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecr_repository.palserver will be created
  + resource "aws_ecr_repository" "palserver" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "palserver"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = "a2bcaab0-22fe-484a-90c3-9941aaf47047"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":67,"Program":"tfcmt","SHA1":"6cbe80492b9f606e802a8882eaf4cfdf6286b68a","Target":"terraform/aws/palserver","Vars":{},"WorkflowName":"pull_request_target"} -->